app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."availability" = 't'
---
  def index
    @products = Product.where(availability: true)

INSERT INTO "products" ("name", "brand", "description", "price", "availability", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.products.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "brand" = ?, "description" = ?, "price" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
  def update
    authorize! :manage, @product
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_product
      @product = Product.friendly.find(params[:id])