app/controllers/transactions_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."slug" = ? LIMIT 1  [["slug", "scarf"]]
INSERT INTO "sales" ("buyer_email", "product_id", "created_at", "updated_at", "guid") VALUES (?, ?, ?, ?, ?)  [["buyer_email", "adam@gmail.com"], ["product_id", 3], ["created_at", "2015-04-20 10:31:19.520186"], ["updated_at", "2015-04-20 10:31:19.520186"], ["guid", "b8153946-05d4-4e2d-b41e-2a74415226fc"]]
---
  def create
  	product  = Product.find_by!(slug: params[:slug])
  	token = params[:stripeToken]

    begin

     charge = Stripe::Charge.create(
     	amount: product.price,
     	currency: "eur",
     	card: token,
     	description: current_user.email)

     @sale = product.sales.create!(buyer_email: current_user.email)

SELECT  "sales".* FROM "sales" WHERE "sales"."guid" = ? LIMIT 1  [["guid", "b8153946-05d4-4e2d-b41e-2a74415226fc"]]
---
  def pickup
    @sale = Sale.find_by!(guid: params[:guid])